energia/cc13xx-core/system/source/ti/devices/cc26x0r2/inc/hw_ccfg.h
/******************************************************************************
*  Filename:       hw_ccfg_h
*  Revised:        2017-01-31 09:37:48 +0100 (Tue, 31 Jan 2017)
*  Revision:       48345
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_CCFG_H__
#define __HW_CCFG_H__

//*****************************************************************************
//
// This section defines the register offsets of
// CCFG component
//
//*****************************************************************************
// Extern LF clock configuration
#define CCFG_O_EXT_LF_CLK                                           0x00000FA8

// Mode Configuration 1
#define CCFG_O_MODE_CONF_1                                          0x00000FAC

// CCFG Size and Disable Flags
#define CCFG_O_SIZE_AND_DIS_FLAGS                                   0x00000FB0

// Mode Configuration 0
#define CCFG_O_MODE_CONF                                            0x00000FB4

// Voltage Load 0
#define CCFG_O_VOLT_LOAD_0                                          0x00000FB8

// Voltage Load 1
#define CCFG_O_VOLT_LOAD_1                                          0x00000FBC

// Real Time Clock Offset
#define CCFG_O_RTC_OFFSET                                           0x00000FC0

// Frequency Offset
#define CCFG_O_FREQ_OFFSET                                          0x00000FC4

// IEEE MAC Address 0
#define CCFG_O_IEEE_MAC_0                                           0x00000FC8

// IEEE MAC Address 1
#define CCFG_O_IEEE_MAC_1                                           0x00000FCC

// IEEE BLE Address 0
#define CCFG_O_IEEE_BLE_0                                           0x00000FD0

// IEEE BLE Address 1
#define CCFG_O_IEEE_BLE_1                                           0x00000FD4

// Bootloader Configuration
#define CCFG_O_BL_CONFIG                                            0x00000FD8

// Erase Configuration
#define CCFG_O_ERASE_CONF                                           0x00000FDC

// TI Options
#define CCFG_O_CCFG_TI_OPTIONS                                      0x00000FE0

// Test Access Points Enable 0
#define CCFG_O_CCFG_TAP_DAP_0                                       0x00000FE4

// Test Access Points Enable 1
#define CCFG_O_CCFG_TAP_DAP_1                                       0x00000FE8

// Image Valid
#define CCFG_O_IMAGE_VALID_CONF                                     0x00000FEC

// Protect Sectors 0-31
#define CCFG_O_CCFG_PROT_31_0                                       0x00000FF0

// Protect Sectors 32-63
#define CCFG_O_CCFG_PROT_63_32                                      0x00000FF4

// Protect Sectors 64-95
#define CCFG_O_CCFG_PROT_95_64                                      0x00000FF8

// Protect Sectors 96-127
#define CCFG_O_CCFG_PROT_127_96                                     0x00000FFC

//*****************************************************************************
//
// Register: CCFG_O_EXT_LF_CLK
//
//*****************************************************************************
// Field: [31:24] DIO
//
// Unsigned integer, selecting the DIO to supply external 32kHz clock as
// SCLK_LF when MODE_CONF.SCLK_LF_OPTION is set to EXTERNAL. The selected DIO
// will be marked as reserved by the pin driver (TI-RTOS environment) and hence
// not selectable for other usage.
#define CCFG_EXT_LF_CLK_DIO_W                                                8
#define CCFG_EXT_LF_CLK_DIO_M                                       0xFF000000
#define CCFG_EXT_LF_CLK_DIO_S                                               24

// Field:  [23:0] RTC_INCREMENT
//
// Unsigned integer, defining the input frequency of the external clock and is
// written to AON_RTC:SUBSECINC.VALUEINC. Defined as follows:
// EXT_LF_CLK.RTC_INCREMENT = 2^38/InputClockFrequency in Hertz (e.g.:
// RTC_INCREMENT=0x800000 for InputClockFrequency=32768 Hz)
#define CCFG_EXT_LF_CLK_RTC_INCREMENT_W                                     24
#define CCFG_EXT_LF_CLK_RTC_INCREMENT_M                             0x00FFFFFF
#define CCFG_EXT_LF_CLK_RTC_INCREMENT_S                                      0

//*****************************************************************************
//
// Register: CCFG_O_MODE_CONF_1
//
//*****************************************************************************
// Field: [23:20] ALT_DCDC_VMIN
//
// Minimum voltage for when DC/DC should be used if alternate DC/DC setting is
// enabled (SIZE_AND_DIS_FLAGS.DIS_ALT_DCDC_SETTING=0).
// Voltage = (28 + ALT_DCDC_VMIN) / 16.
// 0: 1.75V
// 1: 1.8125V
// ...
// 14: 2.625V
// 15: 2.6875V
//
// NOTE! The DriverLib function SysCtrl_DCDC_VoltageConditionalControl() must
// be called regularly to apply this field (handled automatically if using TI
// RTOS!).
#define CCFG_MODE_CONF_1_ALT_DCDC_VMIN_W                                     4
#define CCFG_MODE_CONF_1_ALT_DCDC_VMIN_M                            0x00F00000
#define CCFG_MODE_CONF_1_ALT_DCDC_VMIN_S                                    20

// Field:    [19] ALT_DCDC_DITHER_EN
//
// Enable DC/DC dithering if alternate DC/DC setting is enabled
// (SIZE_AND_DIS_FLAGS.DIS_ALT_DCDC_SETTING=0).
// 0: Dither disable
// 1: Dither enable
#define CCFG_MODE_CONF_1_ALT_DCDC_DITHER_EN                         0x00080000
#define CCFG_MODE_CONF_1_ALT_DCDC_DITHER_EN_BITN                            19
#define CCFG_MODE_CONF_1_ALT_DCDC_DITHER_EN_M                       0x00080000
#define CCFG_MODE_CONF_1_ALT_DCDC_DITHER_EN_S                               19

// Field: [18:16] ALT_DCDC_IPEAK
//
// Inductor peak current if alternate DC/DC setting is enabled
// (SIZE_AND_DIS_FLAGS.DIS_ALT_DCDC_SETTING=0). Assuming 10uH external
// inductor!
// Peak current = 31 + ( 4 * ALT_DCDC_IPEAK ) :
// 0: 31mA (min)
// ...
// 4: 47mA
// ...
// 7: 59mA (max)
#define CCFG_MODE_CONF_1_ALT_DCDC_IPEAK_W                                    3
#define CCFG_MODE_CONF_1_ALT_DCDC_IPEAK_M                           0x00070000
#define CCFG_MODE_CONF_1_ALT_DCDC_IPEAK_S                                   16

// Field: [15:12] DELTA_IBIAS_INIT
//
// Signed delta value for IBIAS_INIT. Delta value only applies if
// SIZE_AND_DIS_FLAGS.DIS_XOSC_OVR=0.
// See FCFG1:AMPCOMP_CTRL1.IBIAS_INIT
#define CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_W                                  4
#define CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_M                         0x0000F000
#define CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_S                                 12

// Field:  [11:8] DELTA_IBIAS_OFFSET
//
// Signed delta value for IBIAS_OFFSET. Delta value only applies if
// SIZE_AND_DIS_FLAGS.DIS_XOSC_OVR=0.
// See FCFG1:AMPCOMP_CTRL1.IBIAS_OFFSET
#define CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_W                                4
#define CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_M                       0x00000F00
#define CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_S                                8

// Field:   [7:0] XOSC_MAX_START
//
// Unsigned value of maximum XOSC startup time (worst case) in units of 100us.
// Value only applies if SIZE_AND_DIS_FLAGS.DIS_XOSC_OVR=0.
#define CCFG_MODE_CONF_1_XOSC_MAX_START_W                                    8
#define CCFG_MODE_CONF_1_XOSC_MAX_START_M                           0x000000FF
#define CCFG_MODE_CONF_1_XOSC_MAX_START_S                                    0

//*****************************************************************************
//
// Register: CCFG_O_SIZE_AND_DIS_FLAGS
//
//*****************************************************************************
// Field: [31:16] SIZE_OF_CCFG
//
// Total size of CCFG in bytes.
#define CCFG_SIZE_AND_DIS_FLAGS_SIZE_OF_CCFG_W                              16
#define CCFG_SIZE_AND_DIS_FLAGS_SIZE_OF_CCFG_M                      0xFFFF0000
#define CCFG_SIZE_AND_DIS_FLAGS_SIZE_OF_CCFG_S                              16

// Field:  [15:4] DISABLE_FLAGS
//
// Reserved for future use. Software should not rely on the value of a
// reserved. Writing any other value than the reset/default value may result in
// undefined behavior.
#define CCFG_SIZE_AND_DIS_FLAGS_DISABLE_FLAGS_W                             12
#define CCFG_SIZE_AND_DIS_FLAGS_DISABLE_FLAGS_M                     0x0000FFF0
#define CCFG_SIZE_AND_DIS_FLAGS_DISABLE_FLAGS_S                              4

// Field:     [3] DIS_TCXO
//
// Disable TCXO.
// 0: TCXO functionality enabled.
// 1: TCXO functionality disabled.
// Note:
// An external TCXO is required if DIS_TCXO = 0.
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_TCXO                            0x00000008
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_TCXO_BITN                                3
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_TCXO_M                          0x00000008
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_TCXO_S                                   3

// Field:     [2] DIS_GPRAM
//
// Disable GPRAM (or use the 8K VIMS RAM as CACHE RAM).
// 0: GPRAM is enabled and hence CACHE disabled.
// 1: GPRAM is disabled and instead CACHE is enabled (default).
// Notes:
// - Disabling CACHE will reduce CPU execution speed (up to 60%).
// - GPRAM is 8 K-bytes in size and located at 0x11000000-0x11001FFF if
// enabled.
// See:
// VIMS:CTL.MODE
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_GPRAM                           0x00000004
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_GPRAM_BITN                               2
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_GPRAM_M                         0x00000004
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_GPRAM_S                                  2

