energia/cc13xx-core/system/source/ti/devices/cc26x0r2/inc/hw_ccfg.h
// Field:    [16] BL_LEVEL
//
// Sets the active level of the selected DIO number BL_PIN_NUMBER if boot
// loader backdoor is enabled by the BL_ENABLE field.
// 0: Active low.
// 1: Active high.
#define CCFG_BL_CONFIG_BL_LEVEL                                     0x00010000
#define CCFG_BL_CONFIG_BL_LEVEL_BITN                                        16
#define CCFG_BL_CONFIG_BL_LEVEL_M                                   0x00010000
#define CCFG_BL_CONFIG_BL_LEVEL_S                                           16

// Field:  [15:8] BL_PIN_NUMBER
//
// DIO number that is level checked if the boot loader backdoor is enabled by
// the BL_ENABLE field.
#define CCFG_BL_CONFIG_BL_PIN_NUMBER_W                                       8
#define CCFG_BL_CONFIG_BL_PIN_NUMBER_M                              0x0000FF00
#define CCFG_BL_CONFIG_BL_PIN_NUMBER_S                                       8

// Field:   [7:0] BL_ENABLE
//
// Enables the boot loader backdoor.
// 0xC5: Boot loader backdoor is enabled.
// Any other value: Boot loader backdoor is disabled.
//
// NOTE! Boot loader must be enabled (see BOOTLOADER_ENABLE) if boot loader
// backdoor is enabled.
#define CCFG_BL_CONFIG_BL_ENABLE_W                                           8
#define CCFG_BL_CONFIG_BL_ENABLE_M                                  0x000000FF
#define CCFG_BL_CONFIG_BL_ENABLE_S                                           0

//*****************************************************************************
//
// Register: CCFG_O_ERASE_CONF
//
//*****************************************************************************
// Field:     [8] CHIP_ERASE_DIS_N
//
// Chip erase.
// This bit controls if a chip erase requested through the JTAG WUC TAP will be
// ignored in a following boot caused by a reset of the MCU VD.
// A successful chip erase operation will force the content of the flash main
// bank back to the state as it was when delivered by TI.
// 0: Disable. Any chip erase request detected during boot will be ignored.
// 1: Enable. Any chip erase request detected during boot will be performed by
// the boot FW.
#define CCFG_ERASE_CONF_CHIP_ERASE_DIS_N                            0x00000100
#define CCFG_ERASE_CONF_CHIP_ERASE_DIS_N_BITN                                8
#define CCFG_ERASE_CONF_CHIP_ERASE_DIS_N_M                          0x00000100
#define CCFG_ERASE_CONF_CHIP_ERASE_DIS_N_S                                   8

// Field:     [0] BANK_ERASE_DIS_N
//
// Bank erase.
// This bit controls if the ROM serial boot loader will accept a received Bank
// Erase command (COMMAND_BANK_ERASE).
// A successful Bank Erase operation will erase all main bank sectors not
// protected by write protect configuration bits in CCFG.
// 0: Disable the boot loader bank erase function.
// 1: Enable the boot loader bank erase function.
#define CCFG_ERASE_CONF_BANK_ERASE_DIS_N                            0x00000001
#define CCFG_ERASE_CONF_BANK_ERASE_DIS_N_BITN                                0
#define CCFG_ERASE_CONF_BANK_ERASE_DIS_N_M                          0x00000001
#define CCFG_ERASE_CONF_BANK_ERASE_DIS_N_S                                   0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_TI_OPTIONS
//
//*****************************************************************************
// Field:   [7:0] TI_FA_ENABLE
//
// TI Failure Analysis.
// 0xC5: Enable the functionality of unlocking the TI FA (TI Failure Analysis)
// option with the unlock code.
// All other values: Disable the functionality of unlocking the TI FA option
// with the unlock code.
#define CCFG_CCFG_TI_OPTIONS_TI_FA_ENABLE_W                                  8
#define CCFG_CCFG_TI_OPTIONS_TI_FA_ENABLE_M                         0x000000FF
#define CCFG_CCFG_TI_OPTIONS_TI_FA_ENABLE_S                                  0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_TAP_DAP_0
//
//*****************************************************************************
// Field: [23:16] CPU_DAP_ENABLE
//
// Enable CPU DAP.
// 0xC5: Main CPU DAP access is enabled during power-up/system-reset by ROM
// boot FW.
// Any other value: Main CPU DAP access will remain disabled out of
// power-up/system-reset.
#define CCFG_CCFG_TAP_DAP_0_CPU_DAP_ENABLE_W                                 8
#define CCFG_CCFG_TAP_DAP_0_CPU_DAP_ENABLE_M                        0x00FF0000
#define CCFG_CCFG_TAP_DAP_0_CPU_DAP_ENABLE_S                                16

// Field:  [15:8] PRCM_TAP_ENABLE
//
// Enable PRCM TAP.
// 0xC5: PRCM TAP access is enabled during power-up/system-reset by ROM boot FW
// if enabled by corresponding configuration value in FCFG1 defined by TI.
// Any other value: PRCM TAP access will remain disabled out of
// power-up/system-reset.
#define CCFG_CCFG_TAP_DAP_0_PRCM_TAP_ENABLE_W                                8
#define CCFG_CCFG_TAP_DAP_0_PRCM_TAP_ENABLE_M                       0x0000FF00
#define CCFG_CCFG_TAP_DAP_0_PRCM_TAP_ENABLE_S                                8

// Field:   [7:0] TEST_TAP_ENABLE
//
// Enable Test TAP.
// 0xC5: TEST TAP access is enabled during power-up/system-reset by ROM boot FW
// if enabled by corresponding configuration value in FCFG1 defined by TI.
// Any other value: TEST TAP access will remain disabled out of
// power-up/system-reset.
#define CCFG_CCFG_TAP_DAP_0_TEST_TAP_ENABLE_W                                8
#define CCFG_CCFG_TAP_DAP_0_TEST_TAP_ENABLE_M                       0x000000FF
#define CCFG_CCFG_TAP_DAP_0_TEST_TAP_ENABLE_S                                0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_TAP_DAP_1
//
//*****************************************************************************
// Field: [23:16] PBIST2_TAP_ENABLE
//
// Enable PBIST2 TAP.
// 0xC5: PBIST2 TAP access is enabled during power-up/system-reset by ROM boot
// FW if enabled by corresponding configuration value in FCFG1 defined by TI.
// Any other value: PBIST2 TAP access will remain disabled out of
// power-up/system-reset.
#define CCFG_CCFG_TAP_DAP_1_PBIST2_TAP_ENABLE_W                              8
#define CCFG_CCFG_TAP_DAP_1_PBIST2_TAP_ENABLE_M                     0x00FF0000
#define CCFG_CCFG_TAP_DAP_1_PBIST2_TAP_ENABLE_S                             16

// Field:  [15:8] PBIST1_TAP_ENABLE
//
// Enable PBIST1 TAP.
// 0xC5: PBIST1 TAP access is enabled during power-up/system-reset by ROM boot
// FW if enabled by corresponding configuration value in FCFG1 defined by TI.
// Any other value: PBIST1 TAP access will remain disabled out of
// power-up/system-reset.
#define CCFG_CCFG_TAP_DAP_1_PBIST1_TAP_ENABLE_W                              8
#define CCFG_CCFG_TAP_DAP_1_PBIST1_TAP_ENABLE_M                     0x0000FF00
#define CCFG_CCFG_TAP_DAP_1_PBIST1_TAP_ENABLE_S                              8

// Field:   [7:0] WUC_TAP_ENABLE
//
// Enable WUC TAP
// 0xC5: WUC TAP access is enabled during power-up/system-reset by ROM boot FW
// if enabled by corresponding configuration value in FCFG1 defined by TI.
// Any other value: WUC TAP access will remain disabled out of
// power-up/system-reset.
#define CCFG_CCFG_TAP_DAP_1_WUC_TAP_ENABLE_W                                 8
#define CCFG_CCFG_TAP_DAP_1_WUC_TAP_ENABLE_M                        0x000000FF
#define CCFG_CCFG_TAP_DAP_1_WUC_TAP_ENABLE_S                                 0

//*****************************************************************************
//
// Register: CCFG_O_IMAGE_VALID_CONF
//
//*****************************************************************************
// Field:  [31:0] IMAGE_VALID
//
// This field must have a value of 0x00000000 in order for enabling the boot
// sequence to transfer control to a flash image.
// A non-zero value forces the boot sequence to call the boot loader.
//
// For CC2640R2:
// This field must have the address value of the start of the flash vector
// table in order for enabling the boot sequence to transfer control to a flash
// image.
// Any illegal vector table start address value forces the boot sequence to
// call the boot loader.
// Note that if any other legal vector table start address value than 0x0 is
// selected the PRCM:WARMRESET.WR_TO_PINRESET must be set to 1.
#define CCFG_IMAGE_VALID_CONF_IMAGE_VALID_W                                 32
#define CCFG_IMAGE_VALID_CONF_IMAGE_VALID_M                         0xFFFFFFFF
#define CCFG_IMAGE_VALID_CONF_IMAGE_VALID_S                                  0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_PROT_31_0
//
//*****************************************************************************
// Field:    [31] WRT_PROT_SEC_31
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_31                         0x80000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_31_BITN                            31
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_31_M                       0x80000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_31_S                               31

// Field:    [30] WRT_PROT_SEC_30
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_30                         0x40000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_30_BITN                            30
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_30_M                       0x40000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_30_S                               30

// Field:    [29] WRT_PROT_SEC_29
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_29                         0x20000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_29_BITN                            29
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_29_M                       0x20000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_29_S                               29

// Field:    [28] WRT_PROT_SEC_28
//
// 0: Sector protected
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_28                         0x10000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_28_BITN                            28
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_28_M                       0x10000000
#define CCFG_CCFG_PROT_31_0_WRT_PROT_SEC_28_S                               28

